tests/cases/viscoelasticFeedback/constant/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}

viscoelastic
{
    type                viscoelasticStress;
    relaxationTime      1e-4;
    zeroShearViscosity  100;
    mobilityFactor      0;
}
